app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "github_id", "stackoverflow_id", "email_id") VALUES('2010-08-09 03:06:07', '2010-08-09 03:06:07', NULL, NULL, NULL)
---
  def register_user

    if(!params[:user].nil?)
     user = User.create(params[:user]) #user saved in database